Revit 2024 API
FilterStringRule Class
 A filter rule that operates on string values in a Revit project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public class FilterStringRule : FilterValueRule
Visual Basic
Public Class FilterStringRule _
	Inherits FilterValueRule
Visual C++
public ref class FilterStringRule : public FilterValueRule
Remarks
 All string comparisons in this class are performed in the case-insensitive manner.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterRule
 Autodesk.Revit.DB.FilterValueRule
 Autodesk.Revit.DB.FilterStringRule
See Also
FilterStringRule Members
Autodesk.Revit.DB Namespace